title: Console Login without MFA
id: f47ac10b-58cc-4372-a567-0e02b2c3d479
status: experimental
description: >
    Detects when a user logs into the AWS Management Console without using Multi-Factor Authentication (MFA). 
    This is a critical security control that helps protect against unauthorized access.
author: 'Goodness Adediran'
date: 2025-08-23
references:
   - https://expel.com/blog/incident-report-from-cli-to-console-chasing-an-attacker-in-aws/
   - https://naikordian.github.io/blog/posts/brute-force-aws-console/
   - https://aws-samples.github.io/threat-technique-catalog-for-aws/Techniques/T1078.A002.html
   - https://attack.mitre.org/techniques/T1098/001/
   - https://attack.mitre.org/techniques/T1078/004/
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventName: 'ConsoleLogin'
        eventSource: 'signin.amazonaws.com'
        additionalEventData.MFAUsed: 'No'
        responseElements.ConsoleLogin: "Success"
        userIdentity.type: "IAMUser"
    condition: selection
falsepositives:
    - Legitimate users who have not enrolled in MFA.
    - Legitimate users who are using temporary credentials that do not support MFA.
    - Users accessing the console from trusted networks where MFA is not enforced.
level: high
tags:
    - attack.initial_access
    - attack.privilege_escalation
    - attack.persistence
    - attack.defense_evasion
    - attack.t1078.004
    - attack.t1078.001
    - attack.t1098.001
